<h1> <b> Time Series </b> </h1>

In [1]:
import pandas as pd

In [5]:
# laod data 
data = pd.read_excel(r"D:\Power BI\sales_data_Power\Superstore Dataset.xlsx")

In [17]:
df = pd.read_excel(r"D:\Power BI\sales_data_Power\Superstore Dataset.xlsx")

In [91]:
df_new =  pd.read_excel(r"D:\Power BI\sales_data_Power\Superstore Dataset.xlsx")
df_new.head(2)

,Row ID+O6G3A1:R6,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,State,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Profit
0,1,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,41.9136
1,2,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,219.5820

In [93]:
df= df_new[['Order Date', 'Sales', 'Profit']]

In [94]:
data = df.copy()

In [7]:
data.head(2)

,Row ID+O6G3A1:R6,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,State,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Profit
0,1,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.96,2,41.9136
1,2,CA-2019-152156,2019-11-08,2019-11-11,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,Kentucky,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.94,3,219.5820

In [8]:
data.columns

Index(['Row ID+O6G3A1:R6', 'Order ID', 'Order Date', 'Ship Date', 'Ship Mode',
       'Customer ID', 'Customer Name', 'Segment', 'Country', 'City', 'State',
       'Region', 'Product ID', 'Category', 'Sub-Category', 'Product Name',
       'Sales', 'Quantity', 'Profit'],
      dtype='object')

In [ ]:
# Sampling 
# Shift
# Rolling Window d

In [11]:
# we only take order date, profit, sales
data = data[['Order Date', 'Sales', 'Profit']]

In [18]:
df=  df[['Order Date', 'Sales', 'Profit']]

In [12]:
data

     Order Date    Sales    Profit
0    2019-11-08  261.960   41.9136
1    2019-11-08  731.940  219.5820
2    2019-06-12   14.620    6.8714
3    2020-04-15   15.552    5.4432
4    2019-12-05  407.976  132.5922
...         ...      ...       ...
5894 2020-11-17  206.100   55.6470
5895 2020-02-26   91.960   15.6332
5896 2020-02-26  258.576   19.3932
5897 2020-02-26   29.600   13.3200
5898 2020-05-04  243.160   72.9480

[5899 rows x 3 columns]

### check null values 
data.isna().sum()

In [14]:
# checck data types 
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5899 entries, 0 to 5898
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Order Date  5899 non-null   datetime64[ns]
 1   Sales       5899 non-null   float64
 2   Profit      5899 non-null   float64
dtypes: datetime64[ns](1), float64(2)
memory usage: 138.4 KB

In [15]:
# Now Sampline , date column set as index 
data.set_index('Order Date', inplace=True)

In [16]:
data.head(2)

             Sales    Profit
Order Date
2019-11-08  261.96   41.9136
2019-11-08  731.94  219.5820

In [20]:
df.sort_values(by='Order Date')

     Order Date     Sales    Profit
2861 2019-01-02   173.940   38.2668
2862 2019-01-02   231.980   67.2742
5608 2019-01-03    11.880    5.3460
1818 2019-01-03   114.460   28.6150
5607 2019-01-03  1592.850  350.4270
...         ...       ...       ...
759  2020-12-30    13.904    4.5188
760  2020-12-30    20.720    6.4750
525  2020-12-30   323.136   12.1176
527  2020-12-30    52.776   19.7910
526  2020-12-30    90.930    2.7279

[5899 rows x 3 columns]

In [ ]:

# Sampling is just a Creating summarty, 'd', 'w' , 'm', 'q', 'y' , in order to sample my date_col must be in date time format and it must be indexed

# Resample Data 'Data' 
data.resample.rule('Q').arges{'Sales':['sum']})

In [ ]:
monthly_sales= sales_data.resample('M').agg({'Sales':['sum'],'Profit':['sum']})

In [27]:
# Resample the data in daily basis 
daily_sales= data.resample('D').agg({'Sales':['sum']})

In [29]:
daily = data.resample('D').agg({'Sales':['sum'],'Profit':['sum']})

In [30]:
daily.reset_index(inplace=True)

In [32]:
daily.columns

MultiIndex([('Order Date',    ''),
            (     'Sales', 'sum'),
            (    'Profit', 'sum')],
           )

In [26]:
df.sort_values(by='Order Date')

     Order Date     Sales    Profit
2861 2019-01-02   173.940   38.2668
2862 2019-01-02   231.980   67.2742
5608 2019-01-03    11.880    5.3460
1818 2019-01-03   114.460   28.6150
5607 2019-01-03  1592.850  350.4270
...         ...       ...       ...
759  2020-12-30    13.904    4.5188
760  2020-12-30    20.720    6.4750
525  2020-12-30   323.136   12.1176
527  2020-12-30    52.776   19.7910
526  2020-12-30    90.930    2.7279

[5899 rows x 3 columns]

In [38]:
# Resamping Monthly (M) Month End 
data.resample('M').agg({'Sales':['max', 'min']})

C:\Users\Numbur\AppData\Local\Temp\ipykernel_2584\3924021146.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  data.resample('M').agg({'Sales':['max', 'min']})

                Sales
                  max    min
Order Date
2019-01-31   1592.850  1.728
2019-02-28   8749.950  3.762
2019-03-31   4912.590  1.272
2019-04-30   9099.930  2.880
2019-05-31   8399.976  1.504
2019-06-30   4476.800  0.836
2019-07-31   2799.960  1.872
2019-08-31   2887.056  1.788
2019-09-30   4355.168  1.810
2019-10-31  17499.950  1.408
2019-11-30   4499.985  1.192
2019-12-31   9892.740  1.728
2020-01-31   5443.960  2.040
2020-02-29   1640.700  1.788
2020-03-31  13999.960  0.556
2020-04-30   4799.984  1.188
2020-05-31   3359.952  1.188
2020-06-30   3404.500  0.444
2020-07-31   2399.960  1.080
2020-08-31   4416.174  1.584
2020-09-30   4663.736  1.556
2020-10-31  11199.968  0.990
2020-11-30  10499.970  1.248
2020-12-31   2879.952  1.188

In [43]:
# Resampling with MS 
data.resample('MS').agg({'Sales':['max','min', 'sum']})

                Sales
                  max    min          sum
Order Date
2019-01-01   1592.850  1.728   18542.4910
2019-02-01   8749.950  3.762   22978.8150
2019-03-01   4912.590  1.272   51715.8750
2019-04-01   9099.930  2.880   38750.0390
2019-05-01   8399.976  1.504   56987.7280
2019-06-01   4476.800  0.836   40344.5340
2019-07-01   2799.960  1.872   39261.9630
2019-08-01   2887.056  1.788   31115.3743
2019-09-01   4355.168  1.810   73410.0249
2019-10-01  17499.950  1.408   59687.7450
2019-11-01   4499.985  1.192   79411.9658
2019-12-01   9892.740  1.728   96999.0430
2020-01-01   5443.960  2.040   43971.3740
2020-02-01   1640.700  1.788   20301.1334
2020-03-01  13999.960  0.556   58872.3528
2020-04-01   4799.984  1.188   36521.5361
2020-05-01   3359.952  1.188   44261.1102
2020-06-01   3404.500  0.444   52981.7257
2020-07-01   2399.960  1.080   45264.4160
2020-08-01   4416.174  1.584   63120.8880
2020-09-01   4663.736  1.556   87866.6520
2020-10-01  11199.968  0.990   77776.9232
2020-11-01  10499.970  1.248  118447.8250
2020-12-01   2879.952  1.188   83829.3188

In [41]:
# quarters, 
data.resample('Q').agg({'Sales':['sum']}) # Quatere End

C:\Users\Numbur\AppData\Local\Temp\ipykernel_2584\24832921.py:2: FutureWarning: 'Q' is deprecated and will be removed in a future version, please use 'QE' instead.
  data.resample('Q').agg({'Sales':['sum']})

                  Sales
                    sum
Order Date
2019-03-31   93237.1810
2019-06-30  136082.3010
2019-09-30  143787.3622
2019-12-31  236098.7538
2020-03-31  123144.8602
2020-06-30  133764.3720
2020-09-30  196251.9560
2020-12-31  280054.0670

In [42]:
data.resample('QS').agg({'Sales':['sum']}) # Quatere Start

                  Sales
                    sum
Order Date
2019-01-01   93237.1810
2019-04-01  136082.3010
2019-07-01  143787.3622
2019-10-01  236098.7538
2020-01-01  123144.8602
2020-04-01  133764.3720
2020-07-01  196251.9560
2020-10-01  280054.0670

In [44]:
# Year 
data.resample('Y').agg({'Profit':['min', 'max', 'sum']})

C:\Users\Numbur\AppData\Local\Temp\ipykernel_2584\1486979377.py:2: FutureWarning: 'Y' is deprecated and will be removed in a future version, please use 'YE' instead.
  data.resample('Y').agg({'Profit':['min', 'max', 'sum']})

               Profit
                  min        max         sum
Order Date
2019-12-31 -6599.9780  8399.9760  81795.1743
2020-12-31 -3839.9904  6719.9808  93439.2696

In [45]:
data.resample('YS').agg({'Profit':['min', 'max', 'sum']}) # Year Start

               Profit
                  min        max         sum
Order Date
2019-01-01 -6599.9780  8399.9760  81795.1743
2020-01-01 -3839.9904  6719.9808  93439.2696

In [75]:
df.sort_values(by='Order Date',inplace=True)

In [77]:
df.set_index('Order Date', inplace=True)

In [80]:
df = df.resample('D').agg({'Sales':['sum'],'Profit':['sum']})

In [82]:
data = df.copy() 
data.head(2)

              Sales   Profit
                sum      sum
Order Date
2019-01-02   405.92  105.541
2019-01-03  2095.83  386.486

In [ ]:
# m 
# MS
2019-01-01 1200
...        1400
..
.
2022-12-31  2100
Month State 2019 - 01 -01 (1200)
Month End 2019-01-31 (1200)

In [ ]:
# 9.12
1200 : 100, 120, 1500
# summary (sample)
Dat
W 
M

In [ ]:
# Shift () 
-1, 1 
Move 
Y,M, Day, Quart, Week

In [47]:
data.reset_index(inplace=True)

In [57]:
data.sort_values(by='Order Date').set_index('Order Date', inplace=True)

In [59]:
data.set_index('Order Date', inplace=True)

In [62]:
# resample the data datail 
data = data.resample('D').agg({'Sales':['sum'],'Profit':['sum']})

In [67]:
sales_data['sales_shifted']  = sales_data['Sales'].shift(periods = -1)

NameError: name 'sales_data' is not defined

In [70]:
data['sales_shifted'] =data['Sales'].shift(periods=1)

In [ ]:
data

In [83]:
data

                Sales    Profit
                  sum       sum
Order Date
2019-01-02   405.9200  105.5410
2019-01-03  2095.8300  386.4860
2019-01-04  1069.2200   40.4020
2019-01-05   255.9040   46.4568
2019-01-06     0.0000    0.0000
...               ...       ...
2020-12-26   814.5940   61.1202
2020-12-27   177.6360  -31.9742
2020-12-28  1657.3508  253.1188
2020-12-29  2915.5340  644.4338
2020-12-30   713.7900  101.5365

[729 rows x 2 columns]

In [84]:
data['sales_shifted_post'] = data['Sales'].shift(periods=1) # daily

In [85]:
data.head(10)

               Sales    Profit sales_shifted_post
                 sum       sum
Order Date
2019-01-02   405.920  105.5410                NaN
2019-01-03  2095.830  386.4860            405.920
2019-01-04  1069.220   40.4020           2095.830
2019-01-05   255.904   46.4568           1069.220
2019-01-06     0.000    0.0000            255.904
2019-01-07    83.576    8.1391              0.000
2019-01-08  1859.158  449.1403             83.576
2019-01-09   743.046  264.4980           1859.158
2019-01-10   174.750   55.3653            743.046
2019-01-11   149.444   25.0834            174.750

In [86]:
# Weekly Basis (shift) 
# Resample Data By Week 
# Shift , +1, frequency= 'W'

                Sales    Profit sales_shifted_post
                  sum       sum
Order Date
2019-01-02   405.9200  105.5410                NaN
2019-01-03  2095.8300  386.4860           405.9200
2019-01-04  1069.2200   40.4020          2095.8300
2019-01-05   255.9040   46.4568          1069.2200
2019-01-06     0.0000    0.0000           255.9040
...               ...       ...                ...
2020-12-26   814.5940   61.1202          2698.9270
2020-12-27   177.6360  -31.9742           814.5940
2020-12-28  1657.3508  253.1188           177.6360
2020-12-29  2915.5340  644.4338          1657.3508
2020-12-30   713.7900  101.5365          2915.5340

[729 rows x 3 columns]

In [88]:
data.columns

MultiIndex([(             'Sales', 'sum'),
            (            'Profit', 'sum'),
            ('sales_shifted_post',    '')],
           )

In [90]:
data.columns

MultiIndex([(             'Sales', 'sum'),
            (            'Profit', 'sum'),
            ('sales_shifted_post',    '')],
           )

In [97]:
data.sort_values(by='Order Date', inplace=True)

In [100]:
data.set_index('Order Date', inplace=True)

In [101]:
data.head(2)

             Sales   Profit
Order Date
2019-01-02  173.94  38.2668
2019-01-02  231.98  67.2742

In [103]:
# Resample Weekly 
resample_weekly = data.resample('W').agg({'Sales':['sum'] , 'Profit':['sum']})

In [111]:
# period -1 
resample_weekly['sales_neg'] = resample_weekly['Sales'].shift(periods=-1, freq='W')

In [112]:
resample_weekly

                 Sales     Profit sales_shift   sales_neg
                   sum        sum
Order Date
2019-01-06   3826.8740   578.8858         NaN   3009.9740
2019-01-13   3009.9740   802.2261    3826.874   2250.0350
2019-01-20   2250.0350   452.4331    3009.974   4707.0580
2019-01-27   4707.0580   517.6463    2250.035  14773.7040
2019-02-03  14773.7040  3515.8232    4707.058   5578.0160
...                ...        ...         ...         ...
2020-12-06  27434.9380  1470.3319   23850.165  23308.4050
2020-12-13  23308.4050   687.4551   27434.938  13010.6350
2020-12-20  13010.6350  1607.4239   23308.405  21433.9480
2020-12-27  21433.9480  3768.5680   13010.635   5286.6748
2021-01-03   5286.6748   999.0891   21433.948         NaN

[105 rows x 4 columns]

In [114]:
# Monthly Shift 
resample_monthly = data.resample('M').agg({'Sales':['sum'], 'Profit':['sum']})

C:\Users\Numbur\AppData\Local\Temp\ipykernel_2584\1913229046.py:2: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  resample_monthly = data.resample('M').agg({'Sales':['sum'], 'Profit':['sum']})

In [118]:
resample_monthly['sales_shifted'] = resample_monthly['Sales'].shift(periods =1, freq='M')

C:\Users\Numbur\AppData\Local\Temp\ipykernel_2584\742131210.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  resample_monthly['sales_shifted'] = resample_monthly['Sales'].shift(periods =1, freq='M')

In [119]:
resample_monthly

                  Sales      Profit sales_shifted
                    sum         sum
Order Date
2019-01-31   18542.4910   2824.8233           NaN
2019-02-28   22978.8150   5004.5795    18542.4910
2019-03-31   51715.8750   3611.9680    22978.8150
2019-04-30   38750.0390   2977.8149    51715.8750
2019-05-31   56987.7280   8662.1464    38750.0390
2019-06-30   40344.5340   4750.3781    56987.7280
2019-07-31   39261.9630   4432.8779    40344.5340
2019-08-31   31115.3743   2062.0693    39261.9630
2019-09-30   73410.0249   9328.6576    31115.3743
2019-10-31   59687.7450  16243.1425    73410.0249
2019-11-30   79411.9658   4011.4075    59687.7450
2019-12-31   96999.0430  17885.3093    79411.9658
2020-01-31   43971.3740   7140.4391    96999.0430
2020-02-29   20301.1334   1613.8720    43971.3740
2020-03-31   58872.3528  14751.8915    20301.1334
2020-04-30   36521.5361    933.2900    58872.3528
2020-05-31   44261.1102   6342.5828    36521.5361
2020-06-30   52981.7257   8223.3357    44261.1102
2020-07-31   45264.4160   6952.6212    52981.7257
2020-08-31   63120.8880   9040.9557    45264.4160
2020-09-30   87866.6520  10991.5556    63120.8880
2020-10-31   77776.9232   9275.2755    87866.6520
2020-11-30  118447.8250   9690.1037    77776.9232
2020-12-31   83829.3188   8483.3468   118447.8250

In [123]:
def make_round(val): 
    val_new = round(val,2)
    return val_new

In [124]:
df_new['Sales'].apply(make_round)

0       261.96
1       731.94
2        14.62
3        15.55
4       407.98
         ...
5894    206.10
5895     91.96
5896    258.58
5897     29.60
5898    243.16
Name: Sales, Length: 5899, dtype: float64

In [126]:
df_new['Profit'].apply(make_round)

0        41.91
1       219.58
2         6.87
3         5.44
4       132.59
         ...
5894     55.65
5895     15.63
5896     19.39
5897     13.32
5898     72.95
Name: Profit, Length: 5899, dtype: float64

In [128]:
# abc.json
data = pd.read_json(r"D:\transfer from c\Desktop\test_data.json")

In [129]:
data

                                              people
0  {'name': 'Aarav Sharma', 'address': 'Lazimpat,...
1  {'name': 'Sita Koirala', 'address': 'Biratnaga...
2  {'name': 'Ramesh Adhikari', 'address': 'Bharat...
3  {'name': 'Anita Thapa', 'address': 'Pokhara-8,...
4  {'name': 'Bikash Gurung', 'address': 'Lamachau...
5  {'name': 'Nirmala Poudel', 'address': 'Butwal-...
6  {'name': 'Suman Bhandari', 'address': 'Dhangad...
7  {'name': 'Kiran KC', 'address': 'Tulsipur-6, D...
8  {'name': 'Pooja Shrestha', 'address': 'Bhaktap...
9  {'name': 'Dipendra Rana', 'address': 'Gongabu,...